"""
Создайте класс Triangle, в котором реализованы следующие методы

    1) метод __init__, принимающий три стороны треугольника

    2) метод is_exists, который отвечает на вопрос, существует ли треугольник с текущими сторонами
    Треугольник существует, если каждая сторона треугольника меньше суммы двух других сторон.

    3) метод is_equilateral, который проверяет, является ли треугольник равносторонним
    Треугольник называется равносторонним, если у него все стороны равны

    4) метод is_isosceles, который проверяет, является ли треугольник равнобедренным и существующим.
    Треугольник называется равнобедренным, если у него две стороны равны
"""