"""
Теперь давайте каждое возможное исключение отлавливать отдельным блоком except.

Если возникает исключение типа ValueError, то необходимо вывести фразу «Введите целое число»
Если возникает исключение типа ZeroDivisionError, то необходимо вывести фразу «Делитель не должен быть равен нулю»
"""

try:
    a = int(input())
    b = int(input())
    print(f"Результат деления a на b: {a / b}")
except ValueError:
    print('Введите целое число')
except ZeroDivisionError:
    print('Делитель не должен быть равен нулю')
